---
kind: property
id: P:Autodesk.Revit.DB.Subelement.UniqueId
source: html/2dd5798c-a4cd-edf1-b8c3-52f6cfc7e186.htm
---
# Autodesk.Revit.DB.Subelement.UniqueId Property

A stable unique identifier for this subelement within the document.

## Syntax (C#)
```csharp
public string UniqueId { get; }
```